package main.garbagecollector;

public class GarbageCollector {
    //가비지콜렉터란 무엇인가?
    /*
    코딩을 요리에 비유하면 상당히 재미있는 비유가 될 수 있다.
    한 비지찌개 맛집에서 주방장과 조수가 일하고있다.
    다만 이 비지찌개집은 유명하지만 골목식당이었기 때문에 주방이 상당히 좁아
    요리 재료들을 모두 늘어놓기 곤란할 때가 많았다.
    주방장이 재료들을 주욱 늘어놓고 요리를 하다 보면 옆에 있는 센스있는 조수가
    "음! 비지는 이후에 더 쓰시지 않겠군! 하면서 치워주는데"
    이 조수가 바로
    [가]씨 성을 가진 비지콜렉터이다.
    가비지콜렉터가 일을 하지 않으면 어떻게 될까?
    안타깝게도 맛집의 주방장은 융통성이 더럽게 없기 때문에 재료들이 도마위를 가득 채우고 나면
    드러누워버린다. [메모리 오버플로우]

    예전, 초기의 자바에는 이 가비지 콜렉터가 그닥 유용하지 못했다. 그 이유는
    당시 가비지콜렉터가 동작하면, 모든 작업을 중단하고 음식 재료들을 전수조사했기 때문이다.
    그러나 현재, 가비지콜렉터는 상당히 유용한 수준까지 개선이 되었고(멀티 쓰레딩으로 동작),
    때문에 어느정도 신뢰하고 개발을 할 만하다.

    그러나, 좋은 개발자가 되기 위해서는 반드시 메모리 관리를 할 줄 알아야 한다.
    가비지콜렉터가 유용하다 한들, 직접 코드를 짜는 개발자가 메모리를 관리하는 편이 훨씬 더 완벽하고
    효율적인 코드를 구현해낼 수 있기 때문이다.

    */

}//GarbageCollector
